﻿/*
 * Copyright (c) 2016, Psiphon Inc.
 * All rights reserved.
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 *
 */

/* A single strings file, whose title is specified in your preferences schema. The strings files provide the localized content to display to the user for each of your preferences. */
//
// Root
//

/* Settings item to change the application UI language. */
"APPLICATION_LANGUAGE"    = "Language";

/* Item in a list of languages. Sets the application UI language to the one used by the system. */
"DEFAULT_LANGUAGE"        = "Idioma predefinido";

"APPLICATION_LANGUAGE"    = "Language";
"DEFAULT_LANGUAGE"        = "Idioma predefinido";
"ABOUT"                   = "Sobre";
"CHANGE_REGION"           = "Change Region";
"FAQ"                     = "Perguntas Mais Frequentes";
"HELP"                    = "Ajuda";
"NOTIFICATIONS"           = "Notificações";
"PRIVACY"                 = "Privacidade";
"PRIVACY_POLICY"          = "Política de Privacidade";
"PSIPHON_AND_BROWSER"     = "Psiphon e Navegador";
"PSIPHON_SETTINGS"        = "Definições do Psiphon";
"RATE_US"                 = "Classifique-nos";
"SECURITY"                = "Segurança";
"SEARCH_ENGINE"           = "Mecanismo de Pesquisa";
"SHARE_ON_FACEBOOK"       = "Partilhar no Facebook";
"SHARE_ON_TWITTER"        = "Partilhar no Twitter";
"SOCIAL"                  = "Social";
"SUBMIT_FEEDBACK"         = "Comentário";
"TERMS_OF_USE"            = "Termos de Utilização";
"TUTORIAL"                = "Tutorial";

// Psiphon Settings
"DISABLE_TIMEOUTS"         = "Desativar 'Expiração'";
"PROXY"                    = "Proxy";
"TIMEOUTS"                 = "Expirações";
"USE_UPSTREAM_PROXY"       = "Usar proxy de upstream";
"HOST_ADDRESS"             = "Endereço do hospedeiro";
"PORT"                     = "Porta";
"USE_PROXY_AUTHENTICATION" = "Usar autenticação de proxy";
"PROXY_USERNAME"           = "Nome de utilizador do Proxy";
"PROXY_PASSWORD"           = "Palavra-passe do Proxy";
"PROXY_DOMAIN"             = "Domínio do Proxy";

// Notifications
"SOUND"                   = "Som";
"SOUND_FOOTER"            = "Reproduzir um som quando o estado da ligação é alterado";
"VIBRATE"                 = "Vibrar";
"VIBRATE_FOOTER"          = "Vibrar quando o estado da ligação é alterado";

// Region Selection
"BEST_PERFORMANCE" = "Best Performance";
"UNITED_STATES"   = "United States";
"UNITED_KINGDOM" = "United Kingdom";
"CANADA" = "Canada";
"JAPAN" = "Japan";
"GERMANY" = "Germany";
"SINGAPORE" = "Singapore";
"NETHERLANDS" = "Netherlands";
"INDIA" = "India";
"SPAIN" = "Spain";

// Search Engine
"SEARCH_ENGINE"           = "Mecanismo de Pesquisa";
"DUCKDUCKGO"              = "DuckDuckGo";
"GOOGLE"                  = "Google";
"START_PAGE"              = "Página inicial";

// Privacy
"CLEAR_ALL_WHEN_BACKGROUNDED"        = "Limpar tudo quando em segundo plano";
"CLEAR_ALL_WHEN_BACKGROUNDED_FOOTER" = "Serão limpos todos os separadores e cookies fora da lista branca quando mudar para outra aplicação.";
"CLEAR_COOKIES"                      = "Limpar cookies se não usados por";
"COOKIE_CONTROL"                     = "CONTROLO DE COOKIE";
"COOKIE_CONTROL_FOOTER"              = "Limpar cookies e dados de armazenamento local dos hospedeiros fora da lista branca se não usados neste intervalo de tempo";
"COOKIE_WHITELIST"                   = "Lista Branca de Cookies";
"SEND_DO_NOT_TRACK"                  = "Enviar pedidos de \"Não Monitoriza\"";

"MINS_FIFTEEN"                       = "15 min.";
"MINS_THIRTY"                        = "30 min.";
"HOURS_TWELVE"                       = "12 hrs";
"HOURS_TWENTYFOUR"                   = "24 hrs";

// Security
"HTTPS"                              = "HTTPS";
"HTTPS_EVERYWHERE"                   = "HTTPS EM TODO O LADO";
"MIN_SSL_TLS_VERSION"                = "Versão Mínima de SSL/TLS";
"MIN_SSL_TLS_VERSION_FOOTER"         = "Versão mínima de SSL/TLS requerida para ligações HTTPS; poderá ser necessário forçar a paragem da aplicação para ter efeito.";

"TLS_1_2"                            = "Apenas TLS 1.2 (sem SSL)";
"TLS_1_1_OR_1_2"                     = "Apenas TLS 1.1 ou 1.2 (sem SSL)";
"TLS_1_0_OR_1_1_OR_1_2"              = "TLS 1.0, 1.1, ou 1.2 (sem SSL)";
"AUTO_NEGOTIATE"                     = "Negociar automaticamente\n(SSL v2 / v3, TLS 1.0 / 1.1 / 1.2)";
